app/Controllers/Home.php

SELECT *
FROM "datalokasiobjek"
WHERE "datalokasiobjek"."deleted_at" IS NULL
---
    public function tabel()
    {
        $data['dataobjek'] = $this->tabeldatalokasiobjek->findAll();

SELECT *
FROM "datalokasiobjek"
WHERE "datalokasiobjek"."deleted_at" IS NULL
AND "datalokasiobjek"."id" = '82'
---
    public function edit_data($id)
    {
        $data['dataobjek'] = $this->tabeldatalokasiobjek->find($id);

UPDATE "datalokasiobjek" SET "nama" = 'Anjungan Seni Idrus Tintin2', "deskripsi" = 'Tangkerang Selatan, Jalan Jenderal Sudirman, Simpang Tiga, Bukit Raya, Simpang Tiga, Kec. Bukit Raya, Kota Pekanbaru, Riau 28128', "latitude" = '0.478098912604042', "longitude" = '101.45587729499421', "foto" = 'anjungan.jpg', "updated_at" = '2024-01-05 06:46:37'
WHERE "datalokasiobjek"."id" IN ('82')
---
            'foto' => $nama_foto,
        ];

        if (!$this->tabeldatalokasiobjek->save($data)) {